# Operaciones

In [ ]:
Operaciones sobre series y dataFrames
sumar, restar

In [1]:
import pandas as pd
import numpy as np

In [2]:
# creamos serie 1
serie1 = pd.Series([0,1,2], index = ['a','b','c'])
serie1

a    0
b    1
c    2
dtype: int64

In [3]:
# crear serie2
serie2 = pd.Series([3,4,5,6], index = ['a','b', 'c', 'd'])
serie2

a    3
b    4
c    5
d    6
dtype: int64

In [4]:
# q pasa si sumamos serie1 + serie2
serie1 + serie2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [ ]:
# que pasa con los DAtaFrame

In [5]:
lista_valores = np.arange(4).reshape(2,2)
lista_valores

array([[0, 1],
       [2, 3]])

In [6]:
# nueva manera de construir una lista
# los separa

lista_indices = list('ab')
lista_indices

['a', 'b']

In [7]:
lista_columnas = list('12')
lista_columnas

['1', '2']

In [8]:
# crear df 1
df1 = pd.DataFrame(lista_valores, index = lista_indices, columns = lista_columnas)
df1

   1  2
a  0  1
b  2  3

In [10]:
# creamos df2, pero primero creamos listas
lv2 = np.arange(9).reshape(3,3)
lv2

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [13]:
# lista indices
li2 = list('abc')
li2

['a', 'b', 'c']

In [14]:
# lista columnas
lc2 = list('123')
lc2

['1', '2', '3']

In [15]:
# ahora si creamos df 2
df2 = pd.DataFrame(lv2, index = li2, columns = lc2)
df2

   1  2  3
a  0  1  2
b  3  4  5
c  6  7  8

In [16]:
# q pasa si sumamos df1 + df2
df1 + df2

# suma los elementos q coinciden con elementos

     1    2   3
a  0.0  2.0 NaN
b  5.0  7.0 NaN
c  NaN  NaN NaN

In [17]:
df3 = df1 + df2
df3

     1    2   3
a  0.0  2.0 NaN
b  5.0  7.0 NaN
c  NaN  NaN NaN

In [20]:
df3[df3 >= 0]
# siguen apareciendo nulos

     1    2   3
a  0.0  2.0 NaN
b  5.0  7.0 NaN
c  NaN  NaN NaN

In [22]:
# podemos arreglar usando el metodo add
# le agregamos al df1 ceros y luego los sumamos
# sumamos df1, df2 y si hubieran valores vacios les agrega 0

df1.add(df2, fill_value = 0)

     1    2    3
a  0.0  2.0  2.0
b  5.0  7.0  5.0
c  6.0  7.0  8.0

In [23]:
# puede lo mismo
df2.add(df1, fill_value = 0)

     1    2    3
a  0.0  2.0  2.0
b  5.0  7.0  5.0
c  6.0  7.0  8.0